{"data":{"markdownRemark":{"html":"<p>I don't know about you, but I love to look at sites like <a href=\"https://medium.com/\">Medium</a>, the new <a href=\"https://fonts.google.com/\">Google Fonts</a> site, and any other site that has incredible typography. It feels good when a site is able to bring that familiar feel of print to the web. Furthermore, their amazing ability to control the multitude of typographic nuances like kerning (letter-spacing), leading (line-height) and of course font sizes that end up being perfectly balanced. With <a href=\"http://caniuse.com/#search=vw\">browser support</a> for <code class=\"language-text\">vw</code> and <code class=\"language-text\">vh</code> at an acceptable level, I figured it would be fun to dive into the various methods of achieving typographic bliss.</p>\n<h2>The <code class=\"language-text\">:root</code> Method</h2>\n<p>Lets start with the method I'm currently using myself. <a href=\"https://twitter.com/MikeRiethmuller\">Mike Riethmuller</a> wrote a post titled <a href=\"http://madebymike.com.au/writing/precise-control-responsive-typography/\">Precise control over responsive typography</a>. This method sets out to give developers control of their typography while utilizing <code class=\"language-text\">vw</code> unit. By themselves this unit of measurement don't really offer us a whole lot of control. If we were to just do something like this:</p>\n<p>{% highlight scss %}\nh1 {\nfont-size: 5vw;\n}\n{% endhighlight %}</p>\n<p>We'd get massive headings on larger browsers, and tiny ones on smaller browsers. The next step here would be to add media queries for various breakpoints and adjust the font size. Furthermore, the scaling of the font would not be smooth, instead at that breakpoint the text would jump from one size to the next. Not ideal.</p>\n<h3>calc() the :root</h3>\n<p>The beauty of Mike's method lies in setting the global font size, and calculating it based on the <code class=\"language-text\">vw</code>. Once you've done this, you can utilize <code class=\"language-text\">em</code>s on your heading or paragraph tags very consistently throughout your site. Here's Mikes CodePen demo explaining his method:</p>\n<p data-height=\"354\" data-theme-id=\"dark\" data-slug-hash=\"YPJJYv\" data-default-tab=\"css\" data-user=\"MadeByMike\" data-embed-version=\"2\" className=\"codepen\">See the Pen <a href=\"http://codepen.io/MadeByMike/pen/YPJJYv/\">Precision responsive typography</a> by Mike (<a href=\"http://codepen.io/MadeByMike\">@MadeByMike</a>) on <a href=\"http://codepen.io\">CodePen</a>.</p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n<p>Since Mikes post, a few variations of this method have popped up.</p>\n<h2>Variations</h2>\n<p>Zell Liew has <a href=\"http://zellwk.com/blog/viewport-based-typography/\">a great blog post</a> that dives into the same basic principal of setting the font size globally (on the <code class=\"language-text\">html</code> element in his case). However in Zell's variation, he sets the font size once, and then utilizes percentages of that base font size to calculate the responsive font size based on viewport units. Check out this CodePen demo to see how he's handling the calculations:</p>\n<p data-height=\"354\" data-theme-id=\"dark\" data-slug-hash=\"VarLaJ\" data-default-tab=\"css\" data-user=\"indrekpaas\" data-embed-version=\"2\" className=\"codepen\">See the Pen <a href=\"http://codepen.io/indrekpaas/pen/VarLaJ/\">Cross-browser fluid type</a> by Indrek Paas (<a href=\"http://codepen.io/indrekpaas\">@indrekpaas</a>) on <a href=\"http://codepen.io\">CodePen</a>.</p>\n<script async src=\"//assets.codepen.io/assets/embed/ei.js\"></script>\n<p>The great thing about both of these methods is that since the global font size is set dynamically you can create vertical rhythm by utilizing <code class=\"language-text\">em</code>s or even a <a href=\"https://css-tricks.com/almanac/properties/l/line-height/\">unitless line height</a>.</p>\n<p>And of course, <a href=\"https://www.smashingmagazine.com/2016/05/fluid-typography/\">Smashing Magazine</a> has a pretty solid variation of this method written up as well.</p>\n<h2>Molten Leading</h2>\n<p>Let me start by saying, my dad joke sense of humor automatically makes me love this method. Much like the <code class=\"language-text\">:root</code> method and it's variations I spoke about above, this one utilizes some calculations to set the line-height. <a href=\"http://twitter.com/nicewebtype\">Tim Brown</a> has a lovely blog post entitled <a href=\"http://nicewebtype.com/notes/2012/02/03/molten-leading-or-fluid-line-height/\">Molten leading (or, fluid line-height)</a> that started the conversation around this notion. Shortly after Mr. Mat Marquis built <a href=\"https://github.com/Wilto/Molten-Leading\">a small jQuery function</a> that utilized the calculations from Tim's post to set a fluid line-height.</p>\n<p>Though the post and the plugin are a bit dated, I still feel like the questions asked here are thought provoking ones. And perhaps with the emergence of viewport units, a calculation can be made in conjunction with the calculations made in the <code class=\"language-text\">:root</code> method to give us even more granular control over the vertical rhythm of our typography.</p>\n<h2>Other Resources</h2>\n<p>I also want to give a shoutout to this beautiful article from Robin Rendle entitled <a href=\"https://robinrendle.com/essays/new-web-typography/\">The New Web Typography</a>. He goes into great depth about the typographic decisions we make on the web, and the consequences that they yield.</p>\n<h2>Wrap it up</h2>\n<p>From what I can tell with a little bit of math, and some magic from viewport units, we as Front-End (Frontend, Front End) Developers are now able to think critically about the typography on our sites. Instead of just attributing random units of measurements to our headings, we're able to create some very well thought out and mathematically sound typography. Thanks for reading!</p>","fields":{"title":"The State of Web Typography","date":"20 June, 2016"}}},"pageContext":{"slug":"/2016-06-21-the-state-of-web-typography/"}}