{"data":{"markdownRemark":{"html":"<p>With the increasing support for the feature detection <code>@supports</code> CSS property, I figured it might be a cool idea to dive into this feature a little bit. While listening to <a href=\"http://shoptalkshow.com/episodes/253-rapidfire-84/\">Episode 253</a> of ShopTalk show, Mr. Chris Coyier mentioned possibly a GitHub repo or blog post that has some pre-baked use cases for the <code>@supports</code> property, and here we are!</p>\n<p>Here's a quick little description about what the <code>@supports</code> property does; Essentially, <code>@supports</code> works just like a media query, but detects certain features, rather than viewport dimensions, media types, etc. A feature query more or less. Using <code>@supports</code> in <a href=\"http://caniuse.com/#feat=css-featurequeries\">browsers that support it</a> (Everything except for IE11 and lower at this point) gives us the ability to check wether or not a feature is supported in that particular browser. If it is, the subsequent CSS rules are enforced. If the browser does not support the property, it will just ignore the rule altogether, no harm, no foul.</p>\n<p>The theory is that this would give us an opportunity to conditionally apply CSS based on browser support. A neat thought for sure, but in researching for this blog post, I had a hard time coming up with a solid set of recipes for the rule. Let's run through some of the basic scenarios that crossed my mind first.</p>\n<h2><code>@supports(display: flexbox)</code></h2>\n<p>Alright, so a colleague of yours just sent you an awesome design. Nice grid layout. Time to <strong>flex</strong> your CSS muscles and use some flexbox. But oh no! The accounts team just informed you that you have to support IE9. Well shoot, let's play out how this scenario could go utilizing the <code>@supports</code> rule. Lets use the classic use case for flexbox; You have multiple things (<code>.thing</code>) with a heading and description inside. The description text length is variable, and you want to make sure all the <code>.thing</code>s are the same height, regardless of content length. Maybe something like this:</p>\n<pre><code class=\"language-scss\">  .thing {\n    border: 2px solid #efefef;\n    margin: 10px;\n    padding: 20px;\n\n    // Fallback for IE9 if browser\n    // doesn't support flexbox.\n    float: left;\n    width: calc(33.333333% - 20px);\n\n    h2 {\n      color: #2b2b2b;\n    }\n\n    .description {\n      font-size: 1rem;\n    }\n  }\n\n  // Insert fanciness here\n  @supports (display: flexbox) {\n    .thing-wrapper {\n      align-items: stretch;\n      display: flex;\n      justify-content: center;\n    }\n\n    .thing {\n      flex: 0 1 33.333333%;\n    }\n  }\n</code></pre>\n<p>Awesome! That looks like a solid use case for <code>@supports</code>. We've got a percentage width, and a float applied to the <code>.thing</code> as a fallback for if flexbox is not supported. 👍</p>\n<p>However, to play devils advocate here, what's to stop us from just doing this:</p>\n<pre><code class=\"language-scss\">  .thing-wrapper {\n    align-items: stretch;\n    display: flex;\n    justify-content: center;\n  }\n\n  .thing {\n    border: 2px solid #efefef;\n    flex: 0 1 33.333333%;\n    margin: 10px;\n    padding: 20px;\n\n    //IE9 support\n    float: left;\n    width: calc(33.333333% - 60px);\n\n    h2 {\n      color: #2b2b2b;\n    }\n\n    .description {\n      font-size: 1rem;\n    }\n  }\n</code></pre>\n<p>The <code>.thing-wrapper</code> properties will be ignored, as IE9 doesn't recognize them, and the float and width properties will be ignored on newer browsers, as the <code>display: flex</code> property takes over. Now, organizationally, it might be nice to throw those properties that older browsers don't support into a nice block. But functionally, the benefit seems a bit limited.</p>\n<h2>Hello Operators</h2>\n<p>Let's try another example. The <code>@support</code> rule also accepts a few additional operators: <code>not</code>, <code>and</code>, and <code>or</code>. You can chain these operators to get some fancy results. For example, you can tell tell the <code>@support</code> rule to fire when a browser does not support a CSS property.</p>\n<p>Let's say we want to try out some awesome fancy CSS variables (not utilizing SCSS as my example above does). If the browser does not support CSS variables, then fire off some CSS to compensate.</p>\n<pre><code class=\"language-css\">  @supports not (--color-1: #c0ffee) {\n    .coffee {\n      color: #c0ffee;\n    }\n  }\n</code></pre>\n<p>A basic example, but it gets the job done. What we're saying here is if the browser does <em>not</em> support the use of CSS variables, apply the color directly to the coffee div. This sounds pretty good, but now we have to consider if the browsers this declaration will apply to, even support the <code>@supports</code> rule. If the browser does not support the <code>@supports</code> rule to begin with, this chunk of code will get skipped over, and our coffee div will not get the styling we defined within.</p>\n<p>For this specific example, CSS variables <a href=\"http://caniuse.com/#feat=css-variables\">are not supported</a> in Edge v14. However the <code>@supports</code> rule is. Therefore, this chunk of code will work! Which is great, this definitely seems like a decent use case in this specific scenario.</p>\n<h2>Additional Scenarios</h2>\n<p>To try to remain as unbiased as I could after these two original thoughts, I also ran through a few more scenarios that I won't go into as verbosely as I did in the two above.</p>\n<p>I tried to find some benefit in the use of the rule for CSS keyframes, which ended with the same issues I had with our first flexbox example. I checked out the new <code>display: flow-root</code> property coming down the line (It's <a href=\"https://css-tricks.com/display-flow-root/\">a neat property</a> that replaces the long standing clearfix). This was a good case for the <code>not</code> operator, much like our CSS variable example. And lastly I checked out the use case for CSS 3D transforms. And much like our flexbox example, found the same issues.</p>\n<h2>TL;DR</h2>\n<p>The bottom line here I think, is that the idea of the <code>@supports</code> rule was a fantastic one in the days of yore, when browser support for various CSS properties was a vast, convoluted mess. But today, browser vendors are beginning to support properties at roughly the same time. And even if they don't, it's not as if the same logic JavaScript follows, applies here. If a browser doesn't recognize a CSS property, it skips over it and moves on. There's no perceived performance benefit to utilizing the <code>@supports</code> rule as far as I can tell. There are certainly a few good cases to utilize <code>@supports</code> and the <code>not</code> operator. Especially for older versions of Edge that don't support things like CSS variables. However, to me, the <code>@supports</code> rule seems mostly cosmetic, and provides a clean way to organize CSS properties that your current project's browser requirements may not allow for you to utilize.</p>","fields":{"title":"The Case for (or against) the CSS @supports rule","date":"12 January, 2019"}}},"pageContext":{"slug":"/2017-03-06-the-case-for-or-against-the-supports-rule/"}}